"""Игра "угадай число".
Компьютер сам загадывает и сам же угадывает число.
Используется алгоритм двоичного поиска.
"""

import numpy as np


def binary_predict(number: int = 1) -> int:
    """Используем метод двоичного поиска для угадывания числа от 1 до 100.

    Args:
        number (int, optional): Загаданное число. Defaults to 1.

    Returns:
        int: Число попыток
    """
    count = 0
    
    # Инициализируем границы интервала поиска:
    left = 1
    right = 100
    
    while True:
        count += 1
        
        # На первой итерации цикла создаём переменную-указатель
        # ровно посередине между левой и правой границами интервала поиска.
        #
        # На последующих - переопределяем её после "уполовинивания" 
        # этого интервала (см. ниже).
        pointer = (left+right) // 2
        
        # Если искомое число находится в правой (большей) половине интервала,
        # то мы отбрасывем левую половину, смещая левую границу в середину;
        # если оно находится в левой(меньшей) - то поступаем наоборот.
        #
        # Прибавление к указателю единицы при уполовинивании в большую сторону
        # нужно, чтобы избежать риска зацикливания алгоритма.        
        if number > pointer:
           left = pointer + 1
        elif number < pointer:
            right = pointer        
        else:
            break # Число будет угадано, когда указатель станет ему равен.  
        
    return count


def score_game(random_predict) -> int:
    """Вычисляем среднее количство попыток, за которое наш алгоритм 
       угадывает число (размер выборки - 1000 загаданных случайных чисел). 

    Args:
        random_predict ([type]): функция угадывания

    Returns:
        int: среднее количество попыток
    """
    # В этот список будем заносить результат (количество попыток,
    # понадобившееся для угадывания числа) испытания для каждого
    # числа из выборки.
    count_ls = []
    # Фиксируем сид для воспроизводимости и загадываем 1000 случайных чисел.
    np.random.seed(1)
    random_array = np.random.randint(1, 101, size=(1000))

    for number in random_array:
        count_ls.append(random_predict(number))

    score = int(np.mean(count_ls))
    print(f"Ваш алгоритм угадывает число в среднем за:{score} попыток")
    
    return score


if __name__ == "__main__":
    # RUN
    score_game(random_predict)

